{
  "_name_or_path": "vicuna-7b-v1.3",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 2048,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.28.1",
  "use_cache": true,
  "vocab_size": 32000,
  "base_model_name_or_path": "model/vicuna-7b-v1.3",
  "medusa_num_heads": 5,
  "medusa_num_layers": 1,
  "init_method":"tcp://127.0.0.1:23000"     ,
    "distributed_backend":"gloo",
    "stage_num_hidden_layers_list":[   32],
    "device": "cuda"
}
